src/cf/src/Documents/НалоговаяНакладная/НалоговаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НалоговаяНакладная</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИнвойса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаТовара</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСпособыОплаты</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДенежныхСредств</name>
      <type>
        <types>CatalogRef.TypesDePayment</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Чек</name>
      <type>
        <types>CatalogRef.БанковскиеЧеки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/НалоговаяНакладная/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если РольДоступна("PDV") Тогда 
	//	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МестоХранения");
	//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//	ЭлементОтбора.ПравоеЗначение = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	//	ЭлементОтбора.Использование = Истина;
	//КонецЕсли;
	НомерСтраницы = 1;
	ПрименитьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Состояние панели сведений восстанавливается из сохранённых данных формы.
	ПрименитьСостояниеПанели();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)

	ПрименитьОтборы();

КонецПроцедуры

// Продажи, по которым налоговая накладная уже выписана, показываются приглушённо:
// оформлять по ним нечего, но видеть их в списке нужно.
//
// Параметры:
//  Элемент   - ТаблицаФормы   - таблица продаж
//  Настройки - НастройкиКомпоновкиДанных - настройки динамического списка
//  Строки    - Соответствие   - полученные строки списка
//
&НаСервере
Процедура СписокПродажПриПолученииДанныхНаСервере(Элемент, Настройки, Строки)

	Для Каждого Строка Из Строки Цикл
		Если Строка.Значение.Данные.ЕстьНакладная Тогда
			Оформление = Строка.Значение.Оформление;
			Оформление.ЦветТекста = ЦветаСтиля.ЦветТекстаНедоступныхДанных;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокПродажПриАктивизацииСтроки(Элемент)

	// BSLLS:MagicNumber-off - треть секунды, константа имени не добавит.
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСведенияПродажи", 0.3, Истина);
	// BSLLS:MagicNumber-on

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСведенияПродажи()

	Ссылка = Элементы.СписокПродаж.ТекущаяСтрока;
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСведенияПродажи(Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	// Отложенно: при листании стрелками не дёргать сервер на каждую строку.
	// BSLLS:MagicNumber-off - треть секунды, константа имени не добавит.
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСведения", 0.3, Истина);
	// BSLLS:MagicNumber-on

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСведения()

	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.НалоговаяНакладная") Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьСведения(Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПанель(Команда)

	ПанельСвернута = Истина;
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)

	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФильтры(Команда)

	ОткрытьСтраницуПанели("СтраницаФильтры");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКлиента(Команда)

	ОткрытьСтраницуПанели("СтраницаКлиент");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДетали(Команда)

	ОткрытьСтраницуПанели("СтраницаИнфо");

КонецПроцедуры

&НаКлиенте
Процедура СтраницаНазад(Команда)

	Если НомерСтраницы > 1 Тогда
		НомерСтраницы = НомерСтраницы - 1;
		ПрименитьСтраницу();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаВперед(Команда)

	Если НомерСтраницы < ВсегоСтраниц Тогда
		НомерСтраницы = НомерСтраницы + 1;
		ПрименитьСтраницу();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Свёрнутая панель - столбик значков, развёрнутая - закладки со страницами.
// Значок открывает панель сразу на своей странице, как в УНФ.
//
&НаКлиенте
Процедура ПрименитьСостояниеПанели()

	Элементы.ГруппаПанельЗначки.Видимость = ПанельСвернута;
	Элементы.ГруппаПодвалПанели.Видимость = Не ПанельСвернута;
	Элементы.ГруппаСтраницыСведений.Видимость = Не ПанельСвернута;

КонецПроцедуры

// Разворачивает панель и активирует страницу по имени.
//
// Параметры:
//  ИмяСтраницы - Строка - имя страницы панели сведений
//
&НаКлиенте
Процедура ОткрытьСтраницуПанели(ИмяСтраницы)

	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();
	Элементы.ГруппаСтраницыСведений.ТекущаяСтраница = Элементы[ИмяСтраницы];

КонецПроцедуры

// Ставит либо снимает отборы динамического списка по полям правой панели.
// Отборы программные: пользовательские настройки списка их не перетирают.
//
&НаСервере
Процедура ПрименитьОтборы()

	Отборы = Новый Структура;
	Отборы.Вставить("Контрагент", ОтборКонтрагент);
	Отборы.Вставить("Организация", ОтборОрганизация);
	Отборы.Вставить("МестоХранения", ОтборСклад);
	Отборы.Вставить("Ответственный", ОтборОтветственный);

	Для Каждого Отбор Из Отборы Цикл
		УстановитьОтборПоПолю(Отбор.Ключ, Отбор.Значение);
	КонецЦикла;

	УстановитьОтборПоПолю("Сумма", ОтборСумма, ВидСравненияУсловия(ОтборСуммаУсловие));
	УстановитьОтборПоПолю("Долг", ОтборДолг, ВидСравненияУсловия(ОтборДолгУсловие));

	НомерСтраницы = 1;
	ПрименитьСтраницу();

КонецПроцедуры

// Вид сравнения отбора по позиции тумблера знака.
//
// Параметры:
//  Позиция - Число - 0 - больше, 1 - меньше, 2 - равно
//
// Возвращаемое значение:
//  ВидСравненияКомпоновкиДанных
//
&НаСервере
Функция ВидСравненияУсловия(Позиция)

	// BSLLS:MagicNumber-off - значения объявлены списком выбора тумблера знака.
	Если Позиция = 1 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
	ИначеЕсли Позиция = 2 Тогда
		Возврат ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		Возврат ВидСравненияКомпоновкиДанных.Больше;
	КонецЕсли;
	// BSLLS:MagicNumber-on

КонецФункции

// Знак сравнения для текста запроса по позиции тумблера знака.
//
// Параметры:
//  Позиция - Число - 0 - больше, 1 - меньше, 2 - равно
//
// Возвращаемое значение:
//  Строка
//
&НаСервере
Функция ЗнакУсловия(Позиция)

	// BSLLS:MagicNumber-off - значения объявлены списком выбора тумблера знака.
	Если Позиция = 1 Тогда
		Возврат "<";
	ИначеЕсли Позиция = 2 Тогда
		Возврат "=";
	Иначе
		Возврат ">";
	КонецЕсли;
	// BSLLS:MagicNumber-on

КонецФункции

// Один программный элемент отбора списка: значение пусто - элемент снимается.
// Список значений отбирается видом сравнения «В списке».
//
// Параметры:
//  Поле         - Строка       - имя поля динамического списка
//  Значение     - Произвольный - отбираемое значение или СписокЗначений
//  ВидСравнения - ВидСравненияКомпоновкиДанных, Неопределено - вид сравнения;
//                 не задан - «Равно» («В списке» для списка значений)
//
&НаСервере
Процедура УстановитьОтборПоПолю(Поле, Значение, ВидСравнения = Неопределено)

	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(Поле);

	Найденный = Неопределено;
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных")
			И Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
			Найденный = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	ЗначениеПусто = Не ЗначениеЗаполнено(Значение);
	Если ЗначениеПусто Тогда
		Если Найденный <> Неопределено Тогда
			Список.Отбор.Элементы.Удалить(Найденный);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если Найденный = Неопределено Тогда
		Найденный = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Найденный.ЛевоеЗначение = ПолеКомпоновки;
	КонецЕсли;
	Если ВидСравнения <> Неопределено Тогда
		Найденный.ВидСравнения = ВидСравнения;
	ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Найденный.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		Найденный.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	Найденный.ПравоеЗначение = Значение;
	Найденный.Использование = Истина;

КонецПроцедуры

// Постраничный просмотр: список ограничивается ссылками текущей страницы,
// счётчик «N / M» считается тем же набором условий, что и отборы панели.
// Страницы режутся по дате от новых к старым.
//
&НаСервере
Процедура ПрименитьСтраницу()

	// BSLLS:MagicNumber-off - размер страницы, используется только здесь.
	РазмерСтраницы = 50;
	// BSLLS:MagicNumber-on

	Условия = Новый Массив;
	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		Условия.Добавить("Док.Контрагент = &Контрагент");
		Запрос.УстановитьПараметр("Контрагент", ОтборКонтрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Условия.Добавить("Док.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ОтборОрганизация);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборСклад) Тогда
		Условия.Добавить("Док.МестоХранения = &Склад");
		Запрос.УстановитьПараметр("Склад", ОтборСклад);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборОтветственный) Тогда
		Условия.Добавить("Док.Ответственный = &Ответственный");
		Запрос.УстановитьПараметр("Ответственный", ОтборОтветственный);
	КонецЕсли;
	Если ОтборСумма <> 0 Тогда
		Условия.Добавить("Док.Сумма " + ЗнакУсловия(ОтборСуммаУсловие) + " &СуммаОтбора");
		Запрос.УстановитьПараметр("СуммаОтбора", ОтборСумма);
	КонецЕсли;

	// Долг документа - остаток взаиморасчётов по объекту расчётов, как в запросе
	// динамического списка: фильтр долга добавляет то же соединение.
	ТекстСоединения = "";
	Если ОтборДолг <> 0 Тогда
		// BSLLS:JoinWithVirtualTable-off - та же схема, что в запросе динамического списка.
		// BSLLS:VirtualTableCallWithoutParameters-off - остатки нужны по всем документам страницы.
		ТекстСоединения = "
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки КАК Остатки
			|		ПО Док.Ссылка = Остатки.ОбъектРасчётов";
		// BSLLS:VirtualTableCallWithoutParameters-on
		// BSLLS:JoinWithVirtualTable-on
		Условия.Добавить("ЕСТЬNULL(Остатки.СуммаОстаток, 0) " + ЗнакУсловия(ОтборДолгУсловие) + " &ДолгОтбора");
		Запрос.УстановитьПараметр("ДолгОтбора", ОтборДолг);
	КонецЕсли;

	ТекстУсловий = "";
	Если Условия.Количество() > 0 Тогда
		ТекстУсловий = "
			|ГДЕ
			|	" + СтрСоединить(Условия, "
			|	И ");
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Док.Ссылка) КАК Всего
		|ИЗ
		|	Документ.НалоговаяНакладная КАК Док" + ТекстСоединения + ТекстУсловий;
	Выборка = Запрос.Выполнить().Выбрать();
	Всего = 0;
	Если Выборка.Следующий() Тогда
		Всего = Выборка.Всего;
	КонецЕсли;

	ВсегоСтраниц = Макс(1, Цел((Всего + РазмерСтраницы - 1) / РазмерСтраницы));
	НомерСтраницы = Макс(1, НомерСтраницы);
	НомерСтраницы = Мин(НомерСтраницы, ВсегоСтраниц);

	ПолеСсылки = "Ссылка";
	Если ВсегоСтраниц = 1 Тогда
		УстановитьОтборПоПолю(ПолеСсылки, Неопределено);
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ " + Формат(НомерСтраницы * РазмерСтраницы, "ЧГ=") + "
			|	Док.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.НалоговаяНакладная КАК Док" + ТекстСоединения + ТекстУсловий + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	Док.Дата УБЫВ,
			|	Док.Ссылка";
		Ссылки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

		СсылкиСтраницы = Новый СписокЗначений;
		Для Индекс = (НомерСтраницы - 1) * РазмерСтраницы По Ссылки.ВГраница() Цикл
			СсылкиСтраницы.Добавить(Ссылки[Индекс]);
		КонецЦикла;
		УстановитьОтборПоПолю(ПолеСсылки, СсылкиСтраницы);
	КонецЕсли;

	Элементы.НадписьСтраницы.Заголовок = СтрШаблон("%1 / %2", НомерСтраницы, ВсегоСтраниц);
	Элементы.КнопкаСтраницаНазад.Доступность = НомерСтраницы > 1;
	Элементы.КнопкаСтраницаВперед.Доступность = НомерСтраницы < ВсегоСтраниц;

КонецПроцедуры

// Сведения по продаже закладки «Продажи»: реквизиты, состав и налоговые накладные,
// выписанные по этой продаже.
//
// Параметры:
//  Ссылка - ДокументСсылка.РеализацияТоваровУслуг - текущая строка закладки продаж
//
&НаСервере
Процедура ЗаполнитьСведенияПродажи(Знач Ссылка)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Док.Контрагент КАК Контрагент,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Док.Организация КАК Организация,
		|	Док.МестоХранения КАК МестоХранения,
		|	Док.Ответственный КАК Ответственный,
		|	Док.Комментарий КАК Комментарий,
		|	Док.Сумма КАК Сумма
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Контрагенты.Ссылка = Док.Контрагент
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	Накладная.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НалоговаяНакладная КАК Накладная
		|ГДЕ
		|	Накладная.Основание = &Ссылка
		|;
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	СУММА(Товары.Количество) КАК Количество,
		|	СУММА(Товары.СуммаСНДС) КАК Сумма
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ТЧТовары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результаты = Запрос.ВыполнитьПакет();

	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	ФорматСуммы = "ЧДЦ=2; ЧРГ=' '";

	Строки = Новый Массив;
	Строки.Добавить(Строка(Шапка.Контрагент));
	Если ЗначениеЗаполнено(Шапка.НаименованиеПолное) Тогда
		Строки.Добавить(Шапка.НаименованиеПолное);
	КонецЕсли;
	КлиентТекст = СтрСоединить(Строки, Символы.ПС);

	Строки = Новый Массив;
	ШаблонПродажи = НСтр("ru = 'Продажа: %1'; fr = 'Vente : %1'; en = 'Sale: %1'; es = 'Venta: %1'");
	Строки.Добавить(СтрШаблон(ШаблонПродажи, Строка(Ссылка)));
	Строки.Добавить("");
	Накладные = Новый Массив;
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Накладные.Добавить(Строка(Выборка.Ссылка));
	КонецЦикла;
	Если Накладные.Количество() = 0 Тогда
		Строки.Добавить(НСтр("ru = 'Налоговая накладная не выписана';
			|fr = 'Facture comptable non émise';
			|en = 'Accounting invoice not issued';
			|es = 'Factura contable no emitida'"));
	Иначе
		Строки.Добавить(НСтр("ru = 'Налоговые накладные:'; fr = 'Factures comptables :';
			|en = 'Accounting invoices:'; es = 'Facturas contables:'"));
		Для Каждого Накладная Из Накладные Цикл
			Строки.Добавить(Накладная);
		КонецЦикла;
	КонецЕсли;
	Строки.Добавить("");
	ШаблонСуммы = НСтр("ru = 'Сумма: %1'; fr = 'Montant : %1'; en = 'Amount: %1'; es = 'Importe: %1'");
	Строки.Добавить(СтрШаблон(ШаблонСуммы, Формат(Шапка.Сумма, ФорматСуммы)));
	ИнфоТекст = СтрСоединить(Строки, Символы.ПС);

	ТаблицаСостав.Очистить();
	Состав = Результаты[2].Выбрать();
	Пока Состав.Следующий() Цикл
		СтрокаСостава = ТаблицаСостав.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСостава, Состав);
	КонецЦикла;

КонецПроцедуры

// Правая панель: сведения о документе текущей строки и его состав.
//
// Параметры:
//  Ссылка - ДокументСсылка.НалоговаяНакладная - текущая строка списка
//
&НаСервере
Процедура ЗаполнитьСведения(Знач Ссылка)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Док.Контрагент КАК Контрагент,
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Док.Организация КАК Организация,
		|	Док.МестоХранения КАК МестоХранения,
		|	Док.Ответственный КАК Ответственный,
		|	Док.Менеджер КАК Менеджер,
		|	Док.ДатаИнвойса КАК ДатаИнвойса,
		|	Док.СпособОплаты КАК СпособОплаты,
		|	Док.Основание КАК Основание,
		|	Док.Комментарий КАК Комментарий,
		|	Док.Сумма КАК Сумма
		|ИЗ
		|	Документ.НалоговаяНакладная КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Контрагенты.Ссылка = Док.Контрагент
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	Реквизиты.Реквизит КАК Реквизит,
		|	Реквизиты.Представление КАК Представление
		|ИЗ
		|	Документ.НалоговаяНакладная КАК Док
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыКонтрагентов КАК Реквизиты
		|		ПО Реквизиты.Контрагент = Док.Контрагент
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|;
		|ВЫБРАТЬ
		|	СУММА(Остатки.СуммаОстаток) КАК Долг
		|ИЗ
		|	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(
		|		,
		|		Контрагент В
		|			(ВЫБРАТЬ
		|				Док.Контрагент КАК Контрагент
		|			ИЗ
		|				Документ.НалоговаяНакладная КАК Док
		|			ГДЕ
		|				Док.Ссылка = &Ссылка)) КАК Остатки
		|;
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	СУММА(Товары.Количество) КАК Количество,
		|	СУММА(Товары.СуммаСНДС) КАК Сумма
		|ИЗ
		|	Документ.НалоговаяНакладная.ТЧТовары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результаты = Запрос.ВыполнитьПакет();

	Шапка = Результаты[0].Выбрать();
	Если Не Шапка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	ФорматСуммы = "ЧДЦ=2; ЧРГ=' '";

	// Страница «Клиент»: имя, контакты и общий долг покупателя.
	Строки = Новый Массив;
	Строки.Добавить(Строка(Шапка.Контрагент));
	Если ЗначениеЗаполнено(Шапка.НаименованиеПолное) Тогда
		Строки.Добавить(Шапка.НаименованиеПолное);
	КонецЕсли;
	Строки.Добавить("");
	Контакты = Результаты[1].Выбрать();
	Пока Контакты.Следующий() Цикл
		Строки.Добавить(Строка(Контакты.Реквизит) + ": " + Контакты.Представление);
	КонецЦикла;
	Долги = Результаты[2].Выбрать();
	Если Долги.Следующий() И ЗначениеЗаполнено(Долги.Долг) Тогда
		Строки.Добавить("");
		ШаблонДолга = НСтр("ru = 'Долг всего: %1'; fr = 'Dette totale : %1';
			|en = 'Total debt: %1'; es = 'Deuda total: %1'");
		ДолгСтрокой = Формат(Долги.Долг, ФорматСуммы);
		Строки.Добавить(СтрШаблон(ШаблонДолга, ДолгСтрокой));
	КонецЕсли;
	КлиентТекст = СтрСоединить(Строки, Символы.ПС);

	// Страница «Детали»: реквизиты документа, не выведенные колонками списка.
	Строки = Новый Массив;
	Если ЗначениеЗаполнено(Шапка.Организация) Тогда
		Шаблон = НСтр("ru = 'Наша компания: %1'; fr = 'Notre société: %1'; en = 'Our company: %1'; es = 'Nuestra empresa: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Организация)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.МестоХранения) Тогда
		Шаблон = НСтр("ru = 'Склад: %1'; fr = 'Entrepôt: %1'; en = 'Warehouse: %1'; es = 'Almacén: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.МестоХранения)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Ответственный) Тогда
		Шаблон = НСтр("ru = 'Ответственный: %1'; fr = 'Responsable: %1'; en = 'Responsible: %1'; es = 'Responsable: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Ответственный)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Менеджер) Тогда
		Шаблон = НСтр("ru = 'Менеджер: %1'; fr = 'Manager: %1'; en = 'Manager: %1'; es = 'Gerente: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Менеджер)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.ДатаИнвойса) Тогда
		Шаблон = НСтр("ru = 'Дата инвойса: %1'; fr = 'Date de facture: %1'; en = 'Invoice date: %1'; es = 'Fecha de factura: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.ДатаИнвойса)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.СпособОплаты) Тогда
		Шаблон = НСтр("ru = 'Способ оплаты: %1'; fr = 'Mode de paiement: %1'; en = 'Payment method: %1'; es = 'Forma de pago: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.СпособОплаты)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Основание) Тогда
		Шаблон = НСтр("ru = 'Основание: %1'; fr = 'Base: %1'; en = 'Basis: %1'; es = 'Base: %1'");
		Строки.Добавить(СтрШаблон(Шаблон, Строка(Шапка.Основание)));
	КонецЕсли;
	Если ЗначениеЗаполнено(Шапка.Комментарий) Тогда
		Строки.Добавить("");
		Строки.Добавить(Шапка.Комментарий);
	КонецЕсли;
	Строки.Добавить("");
	ШаблонСуммы = НСтр("ru = 'Сумма: %1'; fr = 'Montant : %1'; en = 'Amount: %1'; es = 'Importe: %1'");
	СуммаСтрокой = Формат(Шапка.Сумма, ФорматСуммы);
	Строки.Добавить(СтрШаблон(ШаблонСуммы, СуммаСтрокой));
	ИнфоТекст = СтрСоединить(Строки, Символы.ПС);

	ТаблицаСостав.Очистить();
	Состав = Результаты[3].Выбрать();
	Пока Состав.Следующий() Цикл
		Строка = ТаблицаСостав.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Состав);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
